
## :x: Apply Failed (koyashiro.net)

[CI link](https://github.com/koyashiro/infra/actions/runs/8821845529)



<pre><code>Error: error creating web analytics site &#34;&#34;: Authentication error (10000)

  with cloudflare_web_analytics_site.koyashiro_net,
  on cloudflare_web_analytics.tf line 1, in resource &#34;cloudflare_web_analytics_site&#34; &#34;koyashiro_net&#34;:
   1: resource &#34;cloudflare_web_analytics_site&#34; &#34;koyashiro_net&#34; {</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
cloudflare_record.mx_alt2: Refreshing state... [id=b739db8088696aca278313b2ee3e21c8]
cloudflare_record.cname_vpm: Refreshing state... [id=2ecd27a583d3aa5d7c8ee4db71d77bc1]
cloudflare_record.mx_alt3: Refreshing state... [id=b992ff41459ab3f5b0e8dcc2bc694827]
cloudflare_record.txt_google_suite_verification: Refreshing state... [id=51aed5edfda688a4954fa9512bd6b0c7]
cloudflare_record.txt_keybase_site_verification: Refreshing state... [id=08a9aea85efa8460b0e4ffcf4e9c1a0f]
cloudflare_record.mx_primary: Refreshing state... [id=1ddf6f336013779c232ec6a394367d77]
cloudflare_record.txt_discord: Refreshing state... [id=6c2a03277c1c0316279abe5f302c5745]
cloudflare_record.txt_google_dkim: Refreshing state... [id=5d46eade5a06f5f800b978d4d3f6bbd0]
cloudflare_record.txt_dmarc: Refreshing state... [id=ed72b5a4988759c6fba528f30aaf8774]
cloudflare_record.mx_alt4: Refreshing state... [id=219a76a69f8880eeae68cc527fdf64a0]
cloudflare_record.mx_alt1: Refreshing state... [id=b42c903d6fe8ebe5dce8544e7cd1f86c]
cloudflare_record.cname_cdn: Refreshing state... [id=7f50c261a33dc44e71e969c856b9d168]
cloudflare_record.txt_spf: Refreshing state... [id=de681523c30bfdbf10f37cbe9cdff23a]
cloudflare_record.txt_dkim: Refreshing state... [id=f8676c4176fbdd3876b32c39e63d997c]
cloudflare_pages_project.koyashiro_net: Refreshing state... [id=koyashiro-net]
cloudflare_record.cname_root: Refreshing state... [id=d58e18342013a85711948497d1a02b1a]
cloudflare_pages_domain.koyashiro_net: Refreshing state... [id=6261a929-2d8b-421d-9056-9859e2c64b5e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_pages_project.koyashiro_net will be updated in-place
  ~ resource "cloudflare_pages_project" "koyashiro_net" {
        id                = "koyashiro-net"
        name              = "koyashiro-net"
        # (5 unchanged attributes hidden)

      ~ build_config {
          + web_analytics_tag   = (known after apply)
          + web_analytics_token = (sensitive value)
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # cloudflare_web_analytics_site.koyashiro_net will be created
  + resource "cloudflare_web_analytics_site" "koyashiro_net" {
      + account_id   = (sensitive value)
      + auto_install = true
      + id           = (known after apply)
      + ruleset_id   = (known after apply)
      + site_tag     = (known after apply)
      + site_token   = (sensitive value)
      + snippet      = (sensitive value)
      + zone_tag     = (sensitive value)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
cloudflare_web_analytics_site.koyashiro_net: Creating...

Error: error creating web analytics site "": Authentication error (10000)

  with cloudflare_web_analytics_site.koyashiro_net,
  on cloudflare_web_analytics.tf line 1, in resource "cloudflare_web_analytics_site" "koyashiro_net":
   1: resource "cloudflare_web_analytics_site" "koyashiro_net" {


```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":189,"Program":"tfcmt","SHA1":"1043226fcbd7b0bf30e8d8eab44374a0dc7835ae","Target":"koyashiro.net","Vars":{},"WorkflowName":"terraform"} -->